#+TITLE: RSS Feed Management
#+PROPERTY: header-args:emacs-lisp :tangle rss.el :results none

This file contains utilities for converting org-mode RSS feed structures to OPML format for FreshRSS.

** Configuration Options

To change the default output location, customize the variable:
#+begin_src emacs-lisp :tangle no
(setq rss-opml-output-file "/Users/me/nix/system/homelab/modules/rssfeeds.opml")
#+end_src

#+RESULTS:
: /Users/me/nix/system/homelab/modules/rssfeeds.opml


